package ru.mkim.backend.model;

import lombok.Getter;

@Getter
public enum CertificateType {
    IATF_16949("IATF 16949"),
    ГОСТР_58139("ГОСТР 58139"),
    ISO_9001("ISO 9001"),
    ISO_9001_2015("ISO 9001:2015"),
    ISO_50001_2018("ISO 50001:2018"),
    ISO_45001_2018("ISO 45001:2018"),
    ISO_3834_2021("ISO 3834:2021"),
    ISO_37001_2016("ISO 37001:2016"),
    ISO_27001_2013("ISO 27001:2013"),
    ISO_22001_2018("ISO 22001:2018"),
    ISO_22000_2018("ISO 22000:2018"),
    ISO_20000_1_2018("ISO 20000-1:2018"),
    ISO_14001_2015("ISO 14001:2015"),
    ISO_13485_2016("ISO 13485:2016"),
    IATF_16949_2016_TO_ISO_9001_2015("IATF 16949:2016 -> ISO 9001:2015"),
    IATF_16949_2016("IATF 16949:2016"),
    FSSC_22000("FSSC 22000"),
    ГОСТ_ISO_13485_2017("ГОСТ ISO 13485-2017"),
    ГОСТ_Р_ИСО_МЭК_27001_2021("ГОСТ Р ИСО/МЭК 27001-2021"),
    ГОСТ_Р_ИСО_9001_2015_СДС("ГОСТ Р ИСО 9001:2015 (СДС)"),
    ГОСТ_Р_ИСО_45001("ГОСТ Р ИСО 45001"),
    ГОСТ_Р_ИСО_14001("ГОСТ Р ИСО 14001"),
    ГОСТ_Р_58139_2018("ГОСТ Р 58139-2018"),
    EN_14065("EN 14065"),
    ГОСТ_Р_ИСО_14001_2016("ГОСТ Р ИСО 14001-2016"),
    ГОСТ_Р_ИСО_9001_2015_ФСА("ГОСТ Р ИСО 9001-2015 (ФСА)");

    private final String typeString;

    CertificateType(String typeString) {
        this.typeString = typeString;
    }
}
